UCB_CS61_lec33.org
# -*- org-export-babel-evaluate: nil -*-
#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args:python :session 第三十三课程 Disjoint Set
#+PROPERTY: header-args:ipython :session 第三十三课程 Disjoint Set
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
#+HTML_HEAD: <script src="https://hypothes.is/embed.js" async></script>
#+HTML_HEAD: <script type="application/json" class="js-hypothesis-config">
#+HTML_HEAD: <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
#+OPTIONS: html-link-use-abs-url:nil html-postamble:nil html-preamble:t
#+OPTIONS: H:3 num:t ^:nil _:nil tags:not-in-toc
#+TITLE: 第三十三课程 Disjoint Set
#+AUTHOR: yiddishkop
#+EMAIL: [[mailto:yiddishkop@163.com][yiddi's email]]
#+TAGS: {PKGIMPT(i) DATAVIEW(v) DATAPREP(p) GRAPHBUILD(b) GRAPHCOMPT(c)} LINAGAPI(a) PROBAPI(b) MATHFORM(f) MLALGO(m)


* What is disjoint set
A _disjoint_sets_ data structure represents a collection of sets that are
_disjoint_: that is, no item is found in more than one set. The collection of
disjoint sets is called a _partition_, because the items are partitioned among
the sets.

Moreover, we work with a _universe_ of items. The universe is made up of all of
the items that can be a member of a set. Every item is a member of exactly one
set.

For example, suppose the items in our universe are corporations that still
exist today or were acquired by other corporations.  Our sets are corporations
that still exist under their own name.  For instance, "Microsoft,"
"Forethought," and "Web TV" are all members of the "Microsoft" set.

We will limit ourselves to two operations.  The first is called a _union_
operation, in which we merge two sets into one.  The second is called a _find_
query, in which we ask a question like, "What corporation does Web TV belong to
today?"  More generally, a "find" query takes an item and tells us which set it
is in.  We will not support operations that break a set up into two or more
sets (not quickly, anyway).  Data structures designed to support these
operations are called _partition_ or _union/find_ data structures.

Applications of union/find data structures include maze generation (which
you'll do in Homework 9) and Kruskal's algorithm for computing the minimum
spanning tree of a graph (which you'll implement in Project 3).

Union/find data structures begin with every item in a separate set.

#+BEGIN_EXAMPLE
-------------- ------------ -------- ------------------- -------- -----------
|Piedmont Air| |Empire Air| |US Air| |Pacific Southwest| |Web TV| |Microsoft|
-------------- ------------ -------- ------------------- -------- -----------
#+END_EXAMPLE

The query "find(Empire Air)" returns "Empire Air".  Suppose we take the union
of Piedmont Air and Empire Air and called the resulting corporation Piedmont
Air.  Similarly, we unite Microsoft with Web TV and US Air with Pacific SW.

#+BEGIN_EXAMPLE
               -------------- ------------------- -----------
               |Piedmont Air| |      US Air     | |Microsoft|
               | Empire Air | |Pacific Southwest| | Web TV  |
               -------------- ------------------- -----------
#+END_EXAMPLE

The query "find(Empire Air)" now returns "Piedmont Air".  Suppose we further
unite US Air with Piedmont Air.

#+BEGIN_EXAMPLE
                -------------------------------- -----------
                |      US Air      Piedmont Air| |Microsoft|
                |Pacific Southwest  Empire Air | | Web TV  |
                -------------------------------- -----------
#+END_EXAMPLE

The query "find(Empire Air)" now returns "US Air".  When Microsoft takes over
US Air, everything will be in one set and no further mergers will be possible.

* List-Based Disjoint Sets and the Quick-Find Algorithm
The obvious data structure for disjoint sets looks like this.
- Each set references a list of the items in that set.
- Each item references the set that contains it.

~find()~ 是 O(1)的原因是，each item knows what set it's in; With this data
structure, find operations take O(1) time; hence, we say that list-based
disjoint sets use the _quick-find_ algorithm.

However, union operations are slow, because when two sets are united, we must
walk through one set and relabel all the items so that they reference the other
set.

Time prevents us from analyzing this algorithm in detail (but see Goodrich and
Tamassia, Section 11.4.3).  Instead, let's move on to the less obvious but
flatly superior _quick-union_ algorithm.

* Tree-Based Disjoint Sets and the Quick-Union Algorithm
** Basic union() and find()
In tree-based disjoint sets, union operations take O(1) time, but find
operations are slower.  However, for any sequence of union and find operations,
the quick-union algorithm is faster overall than the quick-find algorithm.

tree-based 的 tree 不是二叉树，而是一棵普通树。

To support fast unions, each set is stored as a general tree.

The quick-union data structure comprises a _forest_ (a collection of trees), in
which each item is initially the root of its own tree; then trees are merged by
union operations. The quick-union data structure is simpler than the general
tree structures you have studied so far, because there are no child or sibling
references. Every node knows only its parent, and you can only walk up the tree.
The true identity of each set is recorded at its root.

Union is a simple O(1) time operation:

we simply make the root of one set become a child of the root of the other set.
For example, when we form the union of US Air and Piedmont Air:

#+BEGIN_EXAMPLE
                                                          US Air
Piedmont Air        US Air                                 ^  ^
      ^               ^                                    |  |
      |               |                         Piedmont Air  Pacific Southwest
 Empire Air   Pacific Southwest      ====>            ^
                                                      |
                                                 Empire Air
#+END_EXAMPLE

US Air becomes a set containing four members.  However, finding the set to
which a given item belongs is not a constant-time operation.

The find operation is performed by following the chain of parent references
from an item to the root of its tree.  For example, find(Empire Air) will
follow the path of references until it reaches US Air.  The cost of this
operation is proportional to the item's depth in the tree.

因为一直是把小的树，往更大的树上嫁接，所以三层最少也需要 8 个 nodes。

