UCB_CS61_lec33.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-09 四 20:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>第三十三课程 Disjoint Set</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">第三十三课程 Disjoint Set</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org96f5bd9">1. What is disjoint set</a></li>
<li><a href="#org53f26fa">2. List-Based Disjoint Sets and the Quick-Find Algorithm</a></li>
<li><a href="#org1f0bdab">3. Tree-Based Disjoint Sets and the Quick-Union Algorithm</a>
<ul>
<li><a href="#org6a8c293">3.1. Basic union() and find()</a></li>
<li><a href="#org2de7de7">3.2. 2 ways to speed up find()</a></li>
<li><a href="#org90fc8aa">3.3. Implementing Quick-Union with an Array</a>
<ul>
<li><a href="#orgcedb159">3.3.1. union-by-size</a></li>
<li><a href="#orge84544a">3.3.2. Path Compression</a></li>
<li><a href="#orge47c0f9">3.3.3. Naming Sets</a></li>
<li><a href="#orgae87b79">3.3.4. Running Time of Quick-Union</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="org96f5bd9" class="outline-2">
<h2 id="org96f5bd9"><span class="section-number-2">1</span> What is disjoint set</h2>
<div class="outline-text-2" id="text-1">
<p>
A <span class="underline">disjoint_sets</span> data structure represents a collection of sets that are
<span class="underline">disjoint</span>: that is, no item is found in more than one set. The collection of
disjoint sets is called a <span class="underline">partition</span>, because the items are partitioned among
the sets.
</p>

<p>
Moreover, we work with a <span class="underline">universe</span> of items. The universe is made up of all of
the items that can be a member of a set. Every item is a member of exactly one
set.
</p>

<p>
For example, suppose the items in our universe are corporations that still
exist today or were acquired by other corporations.  Our sets are corporations
that still exist under their own name.  For instance, "Microsoft,"
"Forethought," and "Web TV" are all members of the "Microsoft" set.
</p>

<p>
We will limit ourselves to two operations.  The first is called a <span class="underline">union</span>
operation, in which we merge two sets into one.  The second is called a <span class="underline">find</span>
query, in which we ask a question like, "What corporation does Web TV belong to
today?"  More generally, a "find" query takes an item and tells us which set it
is in.  We will not support operations that break a set up into two or more
sets (not quickly, anyway).  Data structures designed to support these
operations are called <span class="underline">partition</span> or <span class="underline">union/find</span> data structures.
</p>

<p>
Applications of union/find data structures include maze generation (which
you'll do in Homework 9) and Kruskal's algorithm for computing the minimum
spanning tree of a graph (which you'll implement in Project 3).
</p>

<p>
Union/find data structures begin with every item in a separate set.
</p>

<pre class="example">
-------------- ------------ -------- ------------------- -------- -----------
|Piedmont Air| |Empire Air| |US Air| |Pacific Southwest| |Web TV| |Microsoft|
-------------- ------------ -------- ------------------- -------- -----------
</pre>

<p>
The query "find(Empire Air)" returns "Empire Air".  Suppose we take the union
of Piedmont Air and Empire Air and called the resulting corporation Piedmont
Air.  Similarly, we unite Microsoft with Web TV and US Air with Pacific SW.
</p>

<pre class="example">
-------------- ------------------- -----------
|Piedmont Air| |      US Air     | |Microsoft|
| Empire Air | |Pacific Southwest| | Web TV  |
-------------- ------------------- -----------
</pre>

<p>
The query "find(Empire Air)" now returns "Piedmont Air".  Suppose we further
unite US Air with Piedmont Air.
</p>

<pre class="example">
-------------------------------- -----------
|      US Air      Piedmont Air| |Microsoft|
|Pacific Southwest  Empire Air | | Web TV  |
-------------------------------- -----------
</pre>

<p>
The query "find(Empire Air)" now returns "US Air".  When Microsoft takes over
US Air, everything will be in one set and no further mergers will be possible.

</p>
</div>
</div>
<div id="org53f26fa" class="outline-2">
<h2 id="org53f26fa"><span class="section-number-2">2</span> List-Based Disjoint Sets and the Quick-Find Algorithm</h2>
<div class="outline-text-2" id="text-2">
<p>
The obvious data structure for disjoint sets looks like this.
</p>
<ul class="org-ul">
<li>Each set references a list of the items in that set.</li>
<li>Each item references the set that contains it.</li>
</ul>

<p>
<code>find()</code> 是 O(1)的原因是，each item knows what set it's in; With this data
structure, find operations take O(1) time; hence, we say that list-based
disjoint sets use the <span class="underline">quick-find</span> algorithm.
</p>

<p>
However, union operations are slow, because when two sets are united, we must
walk through one set and relabel all the items so that they reference the other
set.
</p>

<p>
Time prevents us from analyzing this algorithm in detail (but see Goodrich and
Tamassia, Section 11.4.3).  Instead, let's move on to the less obvious but
flatly superior <span class="underline">quick-union</span> algorithm.
</p>
</div>
</div>

<div id="org1f0bdab" class="outline-2">
<h2 id="org1f0bdab"><span class="section-number-2">3</span> Tree-Based Disjoint Sets and the Quick-Union Algorithm</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="org6a8c293" class="outline-3">
<h3 id="org6a8c293"><span class="section-number-3">3.1</span> Basic union() and find()</h3>
<div class="outline-text-3" id="text-3-1">
<p>
In tree-based disjoint sets, union operations take O(1) time, but find
operations are slower.  However, for any sequence of union and find operations,
the quick-union algorithm is faster overall than the quick-find algorithm.
</p>

<p>
tree-based 的 tree 不是二叉树，而是一棵普通树。
</p>

<p>
To support fast unions, each set is stored as a general tree.
</p>

<p>
The quick-union data structure comprises a <span class="underline">forest</span> (a collection of trees), in
which each item is initially the root of its own tree; then trees are merged by
union operations. The quick-union data structure is simpler than the general
tree structures you have studied so far, because there are no child or sibling
references. Every node knows only its parent, and you can only walk up the tree.
The true identity of each set is recorded at its root.
</p>

<p>
Union is a simple O(1) time operation:
</p>

<p>
we simply make the root of one set become a child of the root of the other set.
For example, when we form the union of US Air and Piedmont Air:
</p>

<pre class="example">
                                                          US Air
Piedmont Air        US Air                                 ^  ^
      ^               ^                                    |  |
      |               |                         Piedmont Air  Pacific Southwest
 Empire Air   Pacific Southwest      ====&gt;            ^
                                                      |
                                                 Empire Air
</pre>

<p>
US Air becomes a set containing four members.  However, finding the set to
which a given item belongs is not a constant-time operation.
</p>

<p>
The find operation is performed by following the chain of parent references
from an item to the root of its tree.  For example, find(Empire Air) will
follow the path of references until it reaches US Air.  The cost of this
operation is proportional to the item's depth in the tree.
</p>

<p>
因为一直是把小的树，往更大的树上嫁接，所以三层最少也需要 8 个 nodes。
</p>
</div>
</div>
