UCB_CS61_lec33.org
** 2 ways to speed up find()
we'll consider two optimizations that make finds faster.

- One strategy, called _union-by-size_, helps the union operation to build
  shorter trees. 简单说就是把小树往大树上嫁接
  - At each root, we record the size of its tree (i.e. the number of nodes in the tree).
  - When we unite two trees, we make the _smaller_ tree a _subtree_ of the larger one (breaking ties arbitrarily).
- The second strategy, called _path compression_, gives the find operation the power to shorten trees.
  - when find() some node, we will fix its ref of parent to root
  - then,next time find this node will only cost O(1) time
  - 这个思想特别像 Splay tree
#+BEGIN_EXAMPLE
                        ___________
    node -> visited! -> |item| .--+---X---> parent
                        -------+---
                               +----------> root
#+END_EXAMPLE

** Implementing Quick-Union with an Array
Suppose the items are non-negative integers, numbered from zero.  We'll use an
array to record the parent of each item.

- If an item has no parent, we'll record the size of its tree.
- To distinguish it from a parent reference, we'll record the size s as the negative number -s.
- Initially, every item is the root of its own tree, so we set every array element to -1.

  #+BEGIN_EXAMPLE
                        -------------------------------
                        |-1|-1|-1|-1|-1|-1|-1|-1|-1|-1|
                        -------------------------------
                          0  1  2  3  4  5  6  7  8  9

The forest illustrated at left below is represented by the array at right.

          8        1        2                  -------------------------------
         / \      /|\                          | 1|-4|-1| 8| 5| 8| 1| 3|-5| 1|
        5   3    9 0 6                         -------------------------------
        |   |                                    0  1  2  3  4  5  6  7  8  9
        4   7
  #+END_EXAMPLE

This is a slightly kludgy way to implement tree-based disjoint sets, but it's
fast (in terms of the constant hidden in the asymptotic notation).
*** union-by-size
Let root1 and root2 be two items that are roots of their respective trees.
Here is code for the union operation with the union-by-size strategy.

#+NAME: union-by-size
#+BEGIN_SRC java
public void union(int root1, int root2) {   (ref:union(int root1, int root2))
  if (array[root2] < array[root1]) {                 // root2 has larger tree
    array[root2] += array[root1];        // update # of items in root2's tree
    array[root1] = root2;                       // make root2 parent of root1
  } else {                                  // root1 has equal or larger tree
    array[root1] += array[root2];        // update # of items in root1's tree
    array[root2] = root1;                       // make root1 parent of root2
  }
}
#+END_SRC

this code is just keeped short for class ,is not a very well encapsulated union
operation though, and the reason why is that a good union operation would hide
the fact that certain node are roots of the tree, because really a disjoint set
data structure, all the external caller is really supposed to know is that this
is a set, they're _not supposed to know that one of those items is special_
because that's an implementation detail and so really you'd like to hide that
implementation detail it's what you really want to do is you really want to
start this([[(union(int root1, int root2))][union]]) by _doing a find on each of these two nodes_ finding the roots
of the two trees and then doing the union.

注意这个 union 和 find 操作对解决之前的 minimum spanning tree ,一个 weighted 图的最小生成树问题:

*minimum spanning tree*:
#+BEGIN_EXAMPLE
1. 遍历 E，不断从 E 中选择 weighted 最小的线段(v,w)
2. 如果 v，w 联通(可以通过判断两者各自所属 set 是否是一个 set，find 函数，比如 list-based disjoint data structue,每个 node
   都存了自己的 root-node 索引，就可以直接 find v 和 w 的 root-node 看是否相同，不同则说明两者不是一个 set，也就不联通)
   则忽略，如果不联通，则 union(set(v),set(w))(这个操作在 list-based disjoint 上就是把数目更小的 set 的每个 node 的
   root-node 索引设置成数目更多的 set 的 root-node 即可),然后将 v-w 存入结果中（结果应该是 v-w, g-h, h-w, v-z...）这个样子。
3. 一旦某个 set 包含了所有 node（这在 list-based disjoint 表现为所有 node 的 root-node 的 reference 都一样）就可以停止遍历 E 了。
#+END_EXAMPLE

*回忆 graph 问题的两种 traversal 方法* ：
#+BEGIN_EXAMPLE
1. DFS： 可以用 recurvise 方式实现，
   1) set all node's 'visited' value false
   2) choose a start-node randomly
   3) visit(start-node)
   4) for every node connected with start-node ---- simply search (v,w) in E
   5) if visited, ignore; else, _recursively_ DFS(this node)
2. BFS: 无法用 recursive，而是用 queue
   1. set all node's visited value to false
   2. choose a start-node randomly
   3. visit(start-node), enqueue(start-node)
   4. _while_ queue is not empty:
      1. current-parent-node = dequeue()
      2. _for_ every node connected with start-node
         1. if visited,ignore; else,visited(this node), and enqueue(this node)
#+END_EXAMPLE

BFS 可以用在 minimum spanning tree 和 shorttest path 问题中;

