UCB_CS61_lec33.html

<div id="org2de7de7" class="outline-3">
<h3 id="org2de7de7"><span class="section-number-3">3.2</span> 2 ways to speed up find()</h3>
<div class="outline-text-3" id="text-3-2">
<p>
we'll consider two optimizations that make finds faster.
</p>

<ul class="org-ul">
<li>One strategy, called <span class="underline">union-by-size</span>, helps the union operation to build
shorter trees. 简单说就是把小树往大树上嫁接
<ul class="org-ul">
<li>At each root, we record the size of its tree (i.e. the number of nodes in the tree).</li>
<li>When we unite two trees, we make the <span class="underline">smaller</span> tree a <span class="underline">subtree</span> of the larger one (breaking ties arbitrarily).</li>
</ul></li>
<li>The second strategy, called <span class="underline">path compression</span>, gives the find operation the power to shorten trees.
<ul class="org-ul">
<li>when find() some node, we will fix its ref of parent to root</li>
<li>then,next time find this node will only cost O(1) time</li>
<li>这个思想特别像 Splay tree</li>
</ul></li>
</ul>
<pre class="example">
                    ___________
node -&gt; visited! -&gt; |item| .--+---X---&gt; parent
                    -------+---
                           +----------&gt; root
</pre>
<p>

</p>
</div>
</div>
<div id="org90fc8aa" class="outline-3">
<h3 id="org90fc8aa"><span class="section-number-3">3.3</span> Implementing Quick-Union with an Array</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Suppose the items are non-negative integers, numbered from zero.  We'll use an
array to record the parent of each item.
</p>

<ul class="org-ul">
<li>If an item has no parent, we'll record the size of its tree.</li>
<li>To distinguish it from a parent reference, we'll record the size s as the negative number -s.</li>
<li><p>
Initially, every item is the root of its own tree, so we set every array element to -1.
</p>

<pre class="example">
                        -------------------------------
                        |-1|-1|-1|-1|-1|-1|-1|-1|-1|-1|
                        -------------------------------
                          0  1  2  3  4  5  6  7  8  9

The forest illustrated at left below is represented by the array at right.

          8        1        2                  -------------------------------
         / \      /|\                          | 1|-4|-1| 8| 5| 8| 1| 3|-5| 1|
        5   3    9 0 6                         -------------------------------
        |   |                                    0  1  2  3  4  5  6  7  8  9
        4   7
</pre></li>
</ul>

<p>
This is a slightly kludgy way to implement tree-based disjoint sets, but it's
fast (in terms of the constant hidden in the asymptotic notation).
</p>
</div>
<div id="orgcedb159" class="outline-4">
<h4 id="orgcedb159"><span class="section-number-4">3.3.1</span> union-by-size</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
Let root1 and root2 be two items that are roots of their respective trees.
Here is code for the union operation with the union-by-size strategy.
</p>

<div class="org-src-container">
<pre class="src src-java" id="org1e7ff88"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">union</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">root1</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">root2</span>) {   (ref:union(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">root1</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">root2</span>))
  <span style="color: #4f97d7; font-weight: bold;">if</span> (array[root2] &lt; array[root1]) {                 <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">root2 has larger tree</span>
    array[root2] += array[root1];        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">update # of items in root2's tree</span>
    array[root1] = root2;                       <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">make root2 parent of root1</span>
  } <span style="color: #4f97d7; font-weight: bold;">else</span> {                                  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">root1 has equal or larger tree</span>
    array[root1] += array[root2];        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">update # of items in root1's tree</span>
    array[root2] = root1;                       <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">make root1 parent of root2</span>
  }
}
</pre>
</div>

<p>
this code is just keeped short for class ,is not a very well encapsulated union
operation though, and the reason why is that a good union operation would hide
the fact that certain node are roots of the tree, because really a disjoint set
data structure, all the external caller is really supposed to know is that this
is a set, they're <span class="underline">not supposed to know that one of those items is special</span>
because that's an implementation detail and so really you'd like to hide that
implementation detail it's what you really want to do is you really want to
start this(<a href="#coderef-union(int root1, int root2)" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-union(int root1, int root2)');" onmouseout="CodeHighlightOff(this, 'coderef-union(int root1, int root2)');">union</a>) by <span class="underline">doing a find on each of these two nodes</span> finding the roots
of the two trees and then doing the union.
</p>

<p>
注意这个 union 和 find 操作对解决之前的 minimum spanning tree ,一个 weighted 图的最小生成树问题:
</p>

<p>
<b>minimum spanning tree</b>:
</p>
<pre class="example">
1. 遍历 E，不断从 E 中选择 weighted 最小的线段(v,w)
2. 如果 v，w 联通(可以通过判断两者各自所属 set 是否是一个 set，find 函数，比如 list-based disjoint data structue,每个 node
   都存了自己的 root-node 索引，就可以直接 find v 和 w 的 root-node 看是否相同，不同则说明两者不是一个 set，也就不联通)
   则忽略，如果不联通，则 union(set(v),set(w))(这个操作在 list-based disjoint 上就是把数目更小的 set 的每个 node 的
   root-node 索引设置成数目更多的 set 的 root-node 即可),然后将 v-w 存入结果中（结果应该是 v-w, g-h, h-w, v-z...）这个样子。
3. 一旦某个 set 包含了所有 node（这在 list-based disjoint 表现为所有 node 的 root-node 的 reference 都一样）就可以停止遍历 E 了。
</pre>

<p>
<b>回忆 graph 问题的两种 traversal 方法</b> ：
</p>
<pre class="example">
1. DFS： 可以用 recurvise 方式实现，
   1) set all node's 'visited' value false
   2) choose a start-node randomly
   3) visit(start-node)
   4) for every node connected with start-node ---- simply search (v,w) in E
   5) if visited, ignore; else, _recursively_ DFS(this node)
2. BFS: 无法用 recursive，而是用 queue
   1. set all node's visited value to false
   2. choose a start-node randomly
   3. visit(start-node), enqueue(start-node)
   4. _while_ queue is not empty:
      1. current-parent-node = dequeue()
      2. _for_ every node connected with start-node
         1. if visited,ignore; else,visited(this node), and enqueue(this node)
</pre>

<p>
BFS 可以用在 minimum spanning tree 和 shorttest path 问题中;
</p>
</div>
</div>
