UCB_CS61_lec33.html

<div id="orge84544a" class="outline-4">
<h4 id="orge84544a"><span class="section-number-4">3.3.2</span> Path Compression</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
The find() method is equally simple, but we need one more trick to obtain the
best possible speed.  Suppose a sequence of union operations creates a tall
tree, and we perform find() repeatedly on its deepest leaf.  Each time we
perform find(), we walk up the tree from leaf to root, perhaps at considerable
expense.  When we perform find() the first time, why not move the leaf up the
tree so that it becomes a child of the root?  That way, next time we perform
find() on the same leaf, it will run much more quickly.  Furthermore, why not
do the same for <span class="underline">every</span> node we encounter as we walk up to the root?
</p>

<p>
we do it in a lazy way which is we don't do it until there's a reason, like
if no one ever does a find operation on one node,then why waste time fixing its
pointer.
</p>

<pre class="example">
      0
     /|\                                      _ 0 _
    1 2 3                                    / /|\ \
   /|\             ==find(7)==&gt;             7 4 1 2 3
  4 5 6                                      /| |\
 /|\                                        8 9 5 6
7 8 9
</pre>

<p>
In the example above, find(7) walks up the tree from 7, discovers that 0 is the
root, and then makes 0 be the parent of 4 and 7, so that future find operations
on 4, 7, or their descendants will be faster.  This technique is called
<span class="underline">path_compression</span>.
</p>

<p>
Let x be an item whose set we wish to identify.  Here is code for find, which
returns the identity of the item at the root of the tree.
</p>

<div class="org-src-container">
<pre class="src src-java" id="orgf98d143"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">find</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">x</span>) {
  <span style="color: #4f97d7; font-weight: bold;">if</span> (array[x] &lt; <span style="color: #a45bad;">0</span>) {
    <span style="color: #4f97d7; font-weight: bold;">return</span> x;                         <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">x is the root of the tree; return it</span>
  } <span style="color: #4f97d7; font-weight: bold;">else</span> {
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Find out who the root is; compress path by making the root x's parent</span>
    array[x] = find(array[x]);        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">in tree-based data structure, array[x] store the parent of x</span>
                                      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">this will,at last make root store in array[x]</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> array[x];                  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Return the root</span>
  }
}
</pre>
</div>
</div>
</div>

<div id="orge47c0f9" class="outline-4">
<h4 id="orge47c0f9"><span class="section-number-4">3.3.3</span> Naming Sets</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
Union-by-size means that if Microsoft acquires US Air, US Air will be the root
of the tree(Microsoft'tree is smaller than US Air's), even though the new
conglomorate might still be called Microsoft.
</p>

<p>
What if we want some control over the names of the sets when we perform union()
operations?
</p>

<p>
The solution is to maintain <span class="underline">an additional array</span> that maps root items to set
names (and perhaps vice versa, depending on the application's needs). For
instance, the array "name" might map 0(where US Air stored) to Microsoft.
</p>

<p>
这个意思大概是维护另一个数组&#x2013;name[]，数组下标与 root 节点的在另一数组的下标相同，但存储的是该 set 的名字，比如这里的 microsoft：
</p>

<pre class="example">
_______________________________
| US Air | xxxx | xxxx | xxxx |
-------------------------------
    0       1       2      3
_______________________________
| microsoft |   |   |   |
-------------------------------
    0
</pre>
<p>
We must modify the union() method so that when it unites two sets, it assigns
the union an appropriate name.
</p>

<p>
For many applications, however, we don't care about the name of a set at all; we
only want to know if two items x and y are in the same set. This is true in both
Homework 9 and Project 3. You only need to run find(x), run find(y), and check
if the two roots are the same.
</p>
</div>
</div>

<div id="orgae87b79" class="outline-4">
<h4 id="orgae87b79"><span class="section-number-4">3.3.4</span> Running Time of Quick-Union</h4>
<div class="outline-text-4" id="text-3-3-4">
<ul class="org-ul">
<li><code>Union</code>: <span class="underline">theta(1)</span></li>
</ul>


<p>
Union operations obviously take Theta(1) time. (Look at the code&#x2013;no loops or
recursion.)
</p>

<ul class="org-ul">
<li><code>Find</code>: <span class="underline">theta(log u)</span></li>
</ul>


<p>
If we use union-by-size, a single find operation can take Theta(log u)
worst-case time, where u is the number of union operations that took place
prior to the find. The only way to increase the height of the tree by one is
to at least double its size from the minimum possible size.
</p>

<p>
就像之前如果 find()一个叶子节点，需要从叶子-&gt;父节点-&gt;&#x2026;-&gt;root。所以这又是一个树的深度问题，所以树的深度就是 O(log(n))
</p>

<ul class="org-ul">
<li><code>Average running time of find() by path compression</code>: <span class="underline">Constant</span></li>
</ul>


<p>
Path compression does not improve this worst-case time, but
it improves the <span class="underline">average</span> running time substantially&#x2013;although a find operation
can take Theta(log u) time, path compression will make that operation fast if
you do it again.  The average running time of find and union operations in the
quick-union data structure(注意，对于 disajoint 数据结构：quick-union 就是指 tree-based,
quick-find 就是 list-based) is so close to a constant that it's hardly worth
mentioning that, in a rigorous asymptotic sense, it's slightly slower.
</p>

<ul class="org-ul">
<li><code>quick-Union Total</code>: theta(u+f*alpha(f+u,u)), <span class="underline">constant</span> approximately.</li>
</ul>


<p>
The bottom line: a sequence of f find and u union operations (in any order and
possibly interleaved) takes Theta(u + f alpha(f + u, u)) time in the worst
case. alpha is an extremely slowly-growing function known as the <span class="underline">inverse</span>
<span class="underline">Ackermann_function</span>.
</p>

<p>
When I say "extremely slowly-growing function", I mean "comically slowly-
growing function."  The inverse Ackermann function is never larger than 4 for
any values of f and u you could ever use (though it does grow arbitrarily
large&#x2013;for unimaginably gigantic values of f and u).  Hence, for all practical
purposes (but not on the Final Exam), you should think of quick-union as having
find operations that run, on average, in constant time.
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
